# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Starship prompt and zsh
brew 'starship'
brew 'zplug'
brew 'zsh'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'gzip'
brew 'watchman'
brew 'wget'
brew 'make'
brew 'nano'
brew 'less'
brew 'most'
brew 'rsync'
brew 'unzip'
brew 'ripgrep'
brew 'exa'
brew 'gnu-sed'
brew 'neofetch'
brew 'tldr'
brew 'ack'
brew 'rename'
brew 'speedtest_cli'
brew 'diff-so-fancy'
brew 'fzf'
brew 'fpp'
brew 'gawk'
brew 'jump'
brew 'tmux'
brew 'reattach-to-user-namespace'

# Media
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'ffmpeg'

# Development
brew 'kubectl'
brew 'kubectx'
brew 'yarn'

# Apps
cask 'aerial'
cask 'alfred3'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'bitwarden'
cask 'imageoptim'
cask 'mysqlworkbench'
cask 'the-unarchiver'
cask 'iina'
cask 'alacritty'
cask 'spotify'
cask 'visual-studio-code'
cask 'bettertouchtool'
cask 'appcleaner'
cask 'dash'
cask 'dropbox'
cask 'steam'
cask 'tunnelblick'
cask 'prusaslicer'

# Quicklook
cask 'syntax-highlight'
cask 'qladdict'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlstephen'
cask 'qlvideo'

# Fonts
cask 'font-cascadia-pl'
cask 'font-cascadia-mono-pl'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
